Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# ai.insight.error.missingProviderFormat
source: No AI provider is configured for “%@”. Open Settings → AI, add a provider, then try generating again.
ar: لم يتم تكوين مزود ذكاء اصطناعي لـ "%@". افتح الإعدادات ← الذكاء الاصطناعي، أضف مزودًا، ثم حاول التوليد مرة أخرى.
de: Für „%@“ ist kein KI-Anbieter konfiguriert. Öffnen Sie Einstellungen → KI, fügen Sie einen Anbieter hinzu, und versuchen Sie dann erneut zu generieren.
es: No hay ningún proveedor de IA configurado para “%@”. Abre Ajustes → IA, añade un proveedor y luego intenta generar de nuevo.
fr: Aucun fournisseur IA configuré pour « %@ ». Ouvrez Réglages → IA, ajoutez un fournisseur, puis réessayez de générer.
id: Tidak ada penyedia AI yang dikonfigurasi untuk "%@". Buka Pengaturan → AI, tambahkan penyedia, lalu coba buat lagi.
it: Nessun provider IA configurato per "%@". Apri Impostazioni → IA, aggiungi un provider, poi riprova a generare.
ja: 「%@」にAIプロバイダが設定されていません。「設定」→「AI」を開き、プロバイダを追加してから、再度生成を試してください。
ko: "%@"에 대해 구성된 AI 제공자가 없습니다. 설정 → AI를 열고 제공자를 추가한 후 다시 생성하세요.
nl: Geen AI-provider geconfigureerd voor “%@”. Open Instellingen → AI, voeg een provider toe en probeer het opnieuw.
pl: Nie skonfigurowano dostawcy AI dla „%@”. Otwórz Ustawienia → AI, dodaj dostawcę, a następnie spróbuj wygenerować ponownie.
pt_br: Nenhum provedor de IA configurado para “%@”. Abra Configurações → IA, adicione um provedor e tente gerar novamente.
ru: Не настроен провайдер ИИ для «%@». Откройте «Настройки» → «ИИ», добавьте провайдера, затем повторите попытку.
tr: "%@" için AI sağlayıcı yapılandırılmamış. Ayarlar → AI'yi açın, bir sağlayıcı ekleyin, ardından tekrar oluşturmayı deneyin.
uk: Не налаштовано постачальника ШІ для «%@». Відкрийте Налаштування → ШІ, додайте постачальника, потім спробуйте згенерувати знову.
vi: Chưa cấu hình nhà cung cấp AI cho “%@”. Mở Cài đặt → AI, thêm nhà cung cấp, sau đó thử tạo lại.
zh_hans: 「%@」尚未配置可用的 AI 服务。请先到「设置 → AI」添加服务商，再生成摘要。
zh_hant: 「%@」尚未設定可用的 AI 服務。請先到「設定 → AI」新增服務商，再產生摘要。

# ai.semanticSearch.error.missingAPIKey
source: Configure an API key in Settings → AI before using semantic search.
ar: قم بتكوين مفتاح API في الإعدادات ← الذكاء الاصطناعي قبل استخدام البحث الدلالي.
de: Konfigurieren Sie einen API-Schlüssel in Einstellungen → KI, bevor Sie die semantische Suche verwenden.
es: Configura una clave API en Ajustes → IA antes de usar la búsqueda semántica.
fr: Configurez une clé API dans Réglages → IA avant d'utiliser la recherche sémantique.
id: Konfigurasikan kunci API di Pengaturan → AI sebelum menggunakan pencarian semantik.
it: Configura una chiave API in Impostazioni → IA prima di usare la ricerca semantica.
ja: セマンティック検索を使用する前に、「設定」→「AI」でAPIキーを設定してください。
ko: 의미 검색을 사용하기 전에 설정 → AI에서 API 키를 구성하세요.
nl: Configureer een API-sleutel in Instellingen → AI voordat u semantisch zoeken gebruikt.
pl: Skonfiguruj klucz API w Ustawienia → AI przed użyciem wyszukiwania semantycznego.
pt_br: Configure uma chave de API em Configurações → IA antes de usar a busca semântica.
ru: Настройте API-ключ в «Настройки» → «ИИ» перед использованием семантического поиска.
tr: Anlamsal aramayı kullanmadan önce Ayarlar → AI'da bir API anahtarı yapılandırın.
uk: Налаштуйте ключ API в Налаштуваннях → ШІ перед використанням семантичного пошуку.
vi: Cấu hình khóa API trong Cài đặt → AI trước khi sử dụng tìm kiếm ngữ nghĩa.
zh_hans: 请先在 Settings → AI 填写 API Key，再使用 AI 语义搜索。
zh_hant: 請先在「設定 → AI」填寫 API Key，再使用 AI 語意搜尋。

# ai.semanticSearch.error.noVectors
source: No semantic index is available.
ar: لا يتوفر فهرس دلالي.
de: Kein semantischer Index verfügbar.
es: No hay ningún índice semántico disponible.
fr: Aucun index sémantique disponible.
id: Tidak ada indeks semantik yang tersedia.
it: Nessun indice semantico disponibile.
ja: セマンティックインデックスが利用できません。
ko: 사용 가능한 의미 인덱스가 없습니다.
nl: Geen semantische index beschikbaar.
pl: Brak dostępnego indeksu semantycznego.
pt_br: Nenhum índice semântico disponível.
ru: Семантический индекс недоступен.
tr: Kullanılabilir anlamsal dizin yok.
uk: Семантичний індекс недоступний.
vi: Không có chỉ mục ngữ nghĩa nào khả dụng.
zh_hans: 没有可用的语义索引。
zh_hant: 沒有可用的語意索引。

# ai.semanticSearch.reason.descriptionMatchFormat
source: Description contains related concepts (similarity %@)
ar: الوصف يحتوي على مفاهيم ذات صلة (تشابه %@)
de: Beschreibung enthält verwandte Konzepte (Ähnlichkeit %@)
es: La descripción contiene conceptos relacionados (similitud %@)
fr: La description contient des concepts liés (similarité %@)
id: Deskripsi mengandung konsep terkait (kesamaan %@)
it: La descrizione contiene concetti correlati (similarità %@)
ja: 説明に関連する概念が含まれています（類似度 %@）
ko: 설명에 관련 개념 포함 (유사도 %@)
nl: Beschrijving bevat gerelateerde concepten (overeenkomst %@)
pl: Opis zawiera powiązane koncepcje (podobieństwo %@)
pt_br: Descrição contém conceitos relacionados (similaridade %@)
ru: Описание содержит связанные концепции (сходство %@)
tr: Açıklama ilgili kavramlar içeriyor (benzerlik %@)
uk: Опис містить пов'язані поняття (схожість %@)
vi: Mô tả chứa các khái niệm liên quan (tương tự %@)
zh_hans: 描述包含相关概念，语义相似度 %@
zh_hant: 描述包含相關概念，語意相似度 %@

# ai.semanticSearch.reason.nameMatchFormat
source: Direct match on repository name (similarity %@)
ar: تطابق مباشر على اسم المستودع (تشابه %@)
de: Direkte Übereinstimmung mit dem Repository-Namen (Ähnlichkeit %@)
es: Coincidencia directa con el nombre del repositorio (similitud %@)
fr: Correspondance directe sur le nom du dépôt (similarité %@)
id: Kecocokan langsung pada nama repositori (kesamaan %@)
it: Corrispondenza diretta sul nome del repository (similarità %@)
ja: リポジトリ名と直接一致（類似度 %@）
ko: 리포지토리 이름과 직접 일치 (유사도 %@)
nl: Directe overeenkomst met repositorynaam (overeenkomst %@)
pl: Bezpośrednie dopasowanie nazwy repozytorium (podobieństwo %@)
pt_br: Correspondência direta com o nome do repositório (similaridade %@)
ru: Прямое совпадение по имени репозитория (сходство %@)
tr: Depo adıyla doğrudan eşleşme (benzerlik %@)
uk: Прямий збіг за назвою репозиторію (схожість %@)
vi: Khớp trực tiếp với tên kho (tương tự %@)
zh_hans: 仓库名直接相关，语义相似度 %@
zh_hant: 倉庫名直接相關，語意相似度 %@

# ai.semanticSearch.reason.notesMatchFormat
source: Notes or field keywords match (similarity %@)
ar: تتطابق الملاحظات أو الكلمات المفتاحية للحقل (تشابه %@)
de: Notizen oder Feld-Schlüsselwörter stimmen überein (Ähnlichkeit %@)
es: Las notas o palabras clave del campo coinciden (similitud %@)
fr: Les notes ou mots-clés de champ correspondent (similarité %@)
id: Catatan atau kata kunci bidang cocok (kesamaan %@)
it: Note o parole chiave del campo corrispondono (similarità %@)
ja: メモまたはフィールドキーワードが一致（類似度 %@）
ko: 메모 또는 필드 키워드 일치 (유사도 %@)
nl: Notities of veldsleutelwoorden komen overeen (overeenkomst %@)
pl: Notatki lub słowa kluczowe pól pasują (podobieństwo %@)
pt_br: Notas ou palavras-chave de campo correspondem (similaridade %@)
ru: Заметки или ключевые слова поля совпадают (сходство %@)
tr: Notlar veya alan anahtar kelimeleri eşleşiyor (benzerlik %@)
uk: Нотатки або ключові слова полів збігаються (схожість %@)
vi: Ghi chú hoặc từ khóa trường khớp (tương tự %@)
zh_hans: 笔记 / 字段关键词命中，语义相似度 %@
zh_hant: 筆記 / 欄位關鍵詞命中，語意相似度 %@

# ai.semanticSearch.reason.topicsMatchFormat
source: Topics match the query (similarity %@)
ar: تتطابق الموضوعات مع الاستعلام (تشابه %@)
de: Themen stimmen mit der Abfrage überein (Ähnlichkeit %@)
es: Los temas coinciden con la consulta (similitud %@)
fr: Les sujets correspondent à la requête (similarité %@)
id: Topik cocok dengan kueri (kesamaan %@)
it: Gli argomenti corrispondono alla query (similarità %@)
ja: トピックがクエリと一致（類似度 %@）
ko: 주제가 쿼리와 일치 (유사도 %@)
nl: Onderwerpen komen overeen met de query (overeenkomst %@)
pl: Tematy pasują do zapytania (podobieństwo %@)
pt_br: Tópicos correspondem à consulta (similaridade %@)
ru: Темы совпадают с запросом (сходство %@)
tr: Konular sorguyla eşleşiyor (benzerlik %@)
uk: Теми збігаються із запитом (схожість %@)
vi: Chủ đề khớp với truy vấn (tương tự %@)
zh_hans: Topics 命中相关方向，语义相似度 %@
zh_hant: Topics 命中相關方向，語意相似度 %@

# ai.semanticSearch.reason.vectorOnlyFormat
source: AI vector similarity %@
ar: تشابه متجه الذكاء الاصطناعي %@
de: KI-Vektorähnlichkeit %@
es: Similitud vectorial IA %@
fr: Similarité vectorielle IA %@
id: Kesamaan vektor AI %@
it: Similarità vettoriale IA %@
ja: AIベクトル類似度 %@
ko: AI 벡터 유사도 %@
nl: AI-vectorovereenkomst %@
pl: Podobieństwo wektorowe AI %@
pt_br: Similaridade vetorial da IA %@
ru: Векторное сходство ИИ %@
tr: AI vektör benzerliği %@
uk: Векторна схожість ШІ %@
vi: Độ tương tự vector AI %@
zh_hans: AI 向量相似度 %@
zh_hant: AI 向量相似度 %@

# ai.task.chat
source: Chat
ar: دردشة
id: Obrolan
ja: チャット
ko: 채팅
pl: Czat
ru: Чат
tr: Sohbet
uk: Чат
vi: Trò chuyện
zh_hans: 对话
zh_hant: 對話

# ai.task.embedding
source: Embedding
ar: تضمين
ja: 埋め込み
ko: 임베딩
pl: Osadzanie
ru: Эмбеддинг
tr: Gömme
uk: Вбудовування
vi: Nhúng
zh_hans: 向量化
zh_hant: 向量化

# ai.task.summary
source: Summary
ar: ملخص
de: Zusammenfassung
es: Resumen
fr: Résumé
id: Ringkasan
it: Riepilogo
ja: サマリー
ko: 요약
nl: Samenvatting
pl: Podsumowanie
pt_br: Resumo
ru: Сводка
tr: Özet
uk: Підсумок
vi: Tóm tắt
zh_hans: 摘要
zh_hant: 摘要

# ai.task.tags
source: Tags
ar: وسوم
es: Etiquetas
fr: Étiquettes
id: Tag
it: Tag
ja: タグ
ko: 태그
pl: Tagi
ru: Теги
tr: Etiketler
uk: Теги
vi: Thẻ
zh_hans: 标签
zh_hant: 標籤

# ai.task.translation
source: Translation
ar: ترجمة
de: Übersetzung
es: Traducción
fr: Traduction
id: Terjemahan
it: Traduzione
ja: 翻訳
ko: 번역
nl: Vertaling
pl: Tłumaczenie
pt_br: Tradução
ru: Перевод
tr: Çeviri
uk: Переклад
vi: Dịch thuật
zh_hans: 翻译
zh_hant: 翻譯

# ai.taskName.chat
source: Chat
ar: دردشة
id: Obrolan
ja: チャット
ko: 채팅
pl: Czat
ru: Чат
tr: Sohbet
uk: Чат
vi: Trò chuyện
zh_hans: 对话
zh_hant: 對話

# ai.taskName.summary
source: Summary
ar: ملخص
de: Zusammenfassung
es: Resumen
fr: Résumé
id: Ringkasan
it: Riepilogo
ja: サマリー
ko: 요약
nl: Samenvatting
pl: Podsumowanie
pt_br: Resumo
ru: Сводка
tr: Özet
uk: Підсумок
vi: Tóm tắt
zh_hans: 摘要
zh_hant: 摘要

# ai.taskName.tagRecommendation
source: Tag Recommendation
ar: اقتراح وسم
de: Tag-Empfehlung
es: Recomendación de etiquetas
fr: Recommandation d'étiquettes
id: Rekomendasi Tag
it: Raccomandazione tag
ja: タグ推奨
ko: 태그 추천
nl: Tagaanbeveling
pl: Rekomendacja tagów
pt_br: Recomendação de Tags
ru: Рекомендация тегов
tr: Etiket Önerisi
uk: Рекомендація тегів
vi: Đề xuất Thẻ
zh_hans: 推荐标签
zh_hant: 推薦標籤

# ai.usage.calls.duration
source: Duration
ar: المدة
de: Dauer
es: Duración
fr: Durée
id: Durasi
it: Durata
ja: 期間
ko: 지속 시간
nl: Duur
pl: Czas trwania
pt_br: Duração
ru: Длительность
tr: Süre
uk: Тривалість
vi: Thời lượng
zh_hans: 耗时
zh_hant: 耗時

# ai.usage.calls.feature
source: Feature
ar: الميزة
de: Funktion
es: Función
fr: Fonctionnalité
id: Fitur
it: Funzionalità
ja: 機能
ko: 기능
nl: Functie
pl: Funkcja
pt_br: Funcionalidade
ru: Функция
tr: Özellik
uk: Функція
vi: Tính năng
zh_hans: 功能
zh_hant: 功能

# ai.usage.calls.model
source: Model
ar: النموذج
de: Modell
es: Modelo
fr: Modèle
it: Modello
ja: モデル
ko: 모델
pt_br: Modelo
ru: Модель
uk: Модель
vi: Mô hình
zh_hans: 模型
zh_hant: 模型

# ai.usage.calls.recentCountFormat
source: Latest %lld calls · Current filters applied
ar: آخر %lld مكالمة · مع تطبيق عوامل التصفية الحالية
de: Letzte %lld Aufrufe · Aktuelle Filter angewendet
es: Últimas %lld llamadas · Filtros actuales aplicados
fr: Derniers %lld appels · Filtres actuels appliqués
id: Panggilan %lld terbaru · Filter saat ini diterapkan
it: Ultime %lld chiamate · Filtri attivi
ja: 最新 %lld 件の呼び出し · 現在のフィルター適用中
ko: 최근 %lld회 호출 · 현재 필터 적용됨
nl: Laatste %lld oproepen · Huidige filters toegepast
pl: Ostatnie %lld wywołań · Bieżące filtry
pt_br: Últimas %lld chamadas · Filtros atuais aplicados
ru: Последние %lld вызовов · Применены текущие фильтры
tr: Son %lld çağrı · Geçerli filtreler uygulanmış
uk: Останні %lld викликів · Застосовано поточні фільтри
vi: %lld cuộc gọi gần đây · Bộ lọc hiện tại đang áp dụng
zh_hans: 最近 %lld 条 · 已应用当前筛选
zh_hant: 最近 %lld 條 · 已套用目前篩選

# ai.usage.calls.shortFormat
source: %lld calls
ar: %lld مكالمة
de: %lld Aufrufe
es: %lld llamadas
fr: %lld appels
id: %lld panggilan
it: %lld chiamate
ja: %lld 件の呼び出し
ko: %lld회 호출
nl: %lld oproepen
pl: %lld wywołań
pt_br: %lld chamadas
ru: %lld вызовов
tr: %lld çağrı
uk: %lld викликів
vi: %lld cuộc gọi
zh_hans: %lld 次
zh_hant: %lld 次

# ai.usage.calls.source
source: Source
ar: المصدر
de: Quelle
es: Fuente
id: Sumber
it: Origine
ja: ソース
ko: 출처
nl: Bron
pl: Źródło
pt_br: Fonte
ru: Источник
tr: Kaynak
uk: Джерело
vi: Nguồn
zh_hans: 来源
zh_hant: 來源

# ai.usage.calls.status
source: Status
ar: الحالة
es: Estado
fr: Statut
it: Stato
ja: ステータス
ko: 상태
ru: Статус
tr: Durum
uk: Статус
vi: Trạng thái
zh_hans: 状态
zh_hant: 狀態

# ai.usage.calls.time
source: Time
ar: الوقت
de: Zeit
es: Hora
fr: Heure
id: Waktu
it: Ora
ja: 時間
ko: 시간
nl: Tijd
pl: Czas
pt_br: Horário
ru: Время
tr: Zaman
uk: Час
vi: Thời gian
zh_hans: 时间
zh_hant: 時間

# ai.usage.detail.calls
source: Recent calls
ar: المكالمات الأخيرة
de: Letzte Aufrufe
es: Llamadas recientes
fr: Appels récents
id: Panggilan terbaru
it: Chiamate recenti
ja: 最近の呼び出し
ko: 최근 호출
nl: Recente oproepen
pl: Ostatnie wywołania
pt_br: Chamadas recentes
ru: Последние вызовы
tr: Son çağrılar
uk: Останні виклики
vi: Cuộc gọi gần đây
zh_hans: 最近调用
zh_hant: 最近呼叫

# ai.usage.detail.feature
source: Features
ar: الميزات
de: Funktionen
es: Funciones
fr: Fonctionnalités
id: Fitur
it: Funzionalità
ja: 機能
ko: 기능
nl: Functies
pl: Funkcje
pt_br: Recursos
ru: Функции
tr: Özellikler
uk: Функції
vi: Tính năng
zh_hans: 功能
zh_hant: 功能

# ai.usage.detail.model
source: Models
ar: النماذج
de: Modelle
es: Modelos
fr: Modèles
id: Model
it: Modelli
ja: モデル
ko: 모델
nl: Modellen
pl: Modele
pt_br: Modelos
ru: Модели
tr: Modeller
uk: Моделі
vi: Mô hình
zh_hans: 模型
zh_hant: 模型

# ai.usage.detail.title
source: Details
ar: التفاصيل
es: Detalles
fr: Détails
id: Detail
it: Dettagli
ja: 詳細
ko: 세부사항
pl: Szczegóły
pt_br: Detalhes
ru: Подробности
tr: Ayrıntılar
uk: Деталі
vi: Chi tiết
zh_hans: 明细
zh_hant: 明細

# ai.usage.empty.clearFilters
source: Clear filters
ar: مسح عوامل التصفية
de: Filter löschen
es: Limpiar filtros
fr: Effacer les filtres
id: Hapus filter
it: Cancella filtri
ja: フィルターをクリア
ko: 필터 지우기
nl: Filters wissen
pl: Wyczyść filtry
pt_br: Limpar filtros
ru: Очистить фильтры
tr: Filtreleri temizle
uk: Очистити фільтри
vi: Xóa bộ lọc
zh_hans: 清除筛选
zh_hant: 清除篩選

# ai.usage.empty.description
source: New Chat and Embedding calls will appear here. Historical usage is not backfilled.
ar: ستظهر هنا مكالمات الدردشة والتضمين الجديدة. لا يتم ملء الاستخدام السابق.
de: Neue Chat- und Embedding-Aufrufe werden hier angezeigt. Der bisherige Verlauf wird nicht nachgetragen.
es: Las nuevas llamadas de Chat y Embedding aparecerán aquí. El uso histórico no se rellena.
fr: Les nouveaux appels de Chat et d’Embedding apparaîtront ici. L’historique n’est pas rétroactif.
id: Panggilan Chat dan Embedding baru akan muncul di sini. Riwayat penggunaan sebelumnya tidak diisi ulang.
it: Nuove chiamate Chat e Embedding appariranno qui. La cronologia precedente non viene recuperata.
ja: 新しいチャットと埋め込みの呼び出しがここに表示されます。過去の使用状況はバックフィルされません。
ko: 새 채팅 및 임베딩 호출이 여기에 표시됩니다. 과거 사용 기록은 백필되지 않습니다.
nl: Nieuwe Chat- en Embedding-oproepen verschijnen hier. Historisch gebruik wordt niet teruggevuld.
pl: Nowe wywołania czatu i osadzania pojawią się tutaj. Historyczne użycie nie jest uzupełniane.
pt_br: Novas chamadas de Chat e Embedding aparecerão aqui. O uso histórico não é preenchido retroativamente.
ru: Новые вызовы Chat и Embedding будут отображаться здесь. История использования не заполняется задним числом.
tr: Yeni Sohbet ve Gömme çağrıları burada görünecek. Geçmiş kullanım doldurulmaz.
uk: Нові виклики Chat та Embedding з'являтимуться тут. Історичне використання не заповнюється.
vi: Các cuộc gọi Chat và Embedding mới sẽ xuất hiện ở đây. Lịch sử sử dụng không được sao lưu.
zh_hans: 新的 Chat 与 Embedding 调用会显示在这里，不会回填历史用量。
zh_hant: 新的 Chat 與 Embedding 呼叫會顯示在這裡，不會回填歷史用量。

# ai.usage.empty.title
source: No AI usage yet
ar: لا يوجد استخدام للذكاء الاصطناعي بعد
de: Noch keine KI-Nutzung
es: Aún no hay uso de IA
fr: Aucune utilisation IA pour l’instant
id: Belum ada penggunaan AI
it: Nessun utilizzo AI ancora
ja: AI使用履歴はまだありません
ko: 아직 AI 사용 기록 없음
nl: Nog geen AI-gebruik
pl: Brak użycia AI
pt_br: Nenhum uso de IA ainda
ru: Использование ИИ пока отсутствует
tr: Henüz AI kullanımı yok
uk: Ще немає використання AI
vi: Chưa có sử dụng AI
zh_hans: 暂无 AI 用量
zh_hant: 暫無 AI 用量

# ai.usage.feature.agent
source: Agent
ar: الوكيل
es: Agente
id: Agen
it: Agente
ja: エージェント
ko: 에이전트
pt_br: Agente
ru: Агент
tr: Ajan
uk: Агент
vi: Tác nhân

# ai.usage.feature.knowledge_indexing
source: Knowledge indexing
ar: فهرسة المعرفة
de: Wissensindexierung
es: Indexación de conocimiento
fr: Indexation des connaissances
id: Pengindeksan pengetahuan
it: Indicizzazione conoscenza
ja: ナレッジインデックス
ko: 지식 인덱싱
nl: Kennisindexering
pl: Indeksowanie wiedzy
pt_br: Indexação de conhecimento
ru: Индексация знаний
tr: Bilgi indeksleme
uk: Індексація знань
vi: Lập chỉ mục kiến thức
zh_hans: 知识库索引
zh_hant: 知識庫索引

# ai.usage.feature.rag
source: Knowledge Q&A
ar: أسئلة وأجوبة المعرفة
de: Wissens-F&A
es: Preguntas y respuestas de conocimiento
fr: Q&R sur les connaissances
id: Tanya Jawab Pengetahuan
it: Q&A conoscenza
ja: ナレッジQ&A
ko: 지식 Q&A
nl: Kennis Q&A
pl: Pytania i odpowiedzi
pt_br: P&R de conhecimento
ru: Вопросы по знаниям
tr: Bilgi S&A
uk: Q&A зі знань
vi: Hỏi đáp kiến thức
zh_hans: 知识库问答
zh_hant: 知識庫問答

# ai.usage.feature.readme_translation
source: README translation
ar: ترجمة README
de: README-Übersetzung
es: Traducción de README
fr: Traduction du README
id: Terjemahan README
it: Traduzione README
ja: README翻訳
ko: README 번역
nl: README-vertaling
pl: Tłumaczenie README
pt_br: Tradução de README
ru: Перевод README
tr: README çevirisi
uk: Переклад README
vi: Dịch README
zh_hans: README 翻译
zh_hant: README 翻譯

# ai.usage.feature.repo_chat
source: Repo chat
ar: دردشة المستودع
es: Chat del repositorio
fr: Chat du dépôt
id: Obrolan repositori
it: Chat repository
ja: リポジトリチャット
ko: 저장소 채팅
pl: Czat repozytorium
pt_br: Chat do repositório
ru: Чат репозитория
tr: Depo sohbeti
uk: Чат репозиторію
vi: Trò chuyện kho
zh_hans: 仓库对话
zh_hant: 倉庫對話

# ai.usage.feature.repo_note
source: Personal note
ar: ملاحظة شخصية
de: Persönliche Notiz
es: Nota personal
fr: Note personnelle
id: Catatan pribadi
it: Nota personale
ja: 個人メモ
ko: 개인 노트
nl: Persoonlijke notitie
pl: Notatka osobista
pt_br: Nota pessoal
ru: Личная заметка
tr: Kişisel not
uk: Особиста нотатка
vi: Ghi chú cá nhân
zh_hans: 个人笔记
zh_hant: 個人筆記

# ai.usage.feature.repo_summary
source: Repo summary
ar: ملخص المستودع
de: Repo-Zusammenfassung
es: Resumen del repositorio
fr: Résumé du dépôt
id: Ringkasan repositori
it: Riepilogo repository
ja: リポジトリサマリー
ko: 저장소 요약
nl: Repo-samenvatting
pl: Podsumowanie repozytorium
pt_br: Resumo do repositório
ru: Сводка репозитория
tr: Depo özeti
uk: Підсумок репозиторію
vi: Tóm tắt kho
zh_hans: 仓库摘要
zh_hant: 倉庫摘要

# ai.usage.feature.repo_tags
source: Tag recommendations
ar: توصيات الوسوم
de: Tag-Empfehlungen
es: Recomendaciones de etiquetas
fr: Recommandations d’étiquettes
id: Rekomendasi tag
it: Raccomandazioni tag
ja: タグ推奨
ko: 태그 추천
nl: Tag-aanbevelingen
pl: Rekomendacje tagów
pt_br: Recomendações de tags
ru: Рекомендации тегов
tr: Etiket önerileri
uk: Рекомендації тегів
vi: Đề xuất thẻ
zh_hans: 标签推荐
zh_hant: 標籤推薦

# ai.usage.feature.semantic_search
source: Semantic search
ar: البحث الدلالي
de: Semantische Suche
es: Búsqueda semántica
fr: Recherche sémantique
id: Pencarian semantik
it: Ricerca semantica
ja: セマンティック検索
ko: 의미 검색
nl: Semantisch zoeken
pl: Wyszukiwanie semantyczne
pt_br: Busca semântica
ru: Семантический поиск
tr: Anlamsal arama
uk: Семантичний пошук
vi: Tìm kiếm ngữ nghĩa
zh_hans: 语义搜索
zh_hant: 語意搜尋

# ai.usage.feature.unknown
source: Other
ar: أخرى
de: Sonstiges
es: Otro
fr: Autre
id: Lainnya
it: Altro
ja: その他
ko: 기타
nl: Overig
pl: Inne
pt_br: Outro
ru: Другое
tr: Diğer
uk: Інше
vi: Khác
zh_hans: 其他
zh_hant: 其他

# ai.usage.filter.allFeatures
source: All features
ar: جميع الميزات
de: Alle Funktionen
es: Todas las funciones
fr: Toutes les fonctionnalités
id: Semua fitur
it: Tutte le funzionalità
ja: すべての機能
ko: 모든 기능
nl: Alle functies
pl: Wszystkie funkcje
pt_br: Todos os recursos
ru: Все функции
tr: Tüm özellikler
uk: Усі функції
vi: Tất cả tính năng
zh_hans: 全部功能
zh_hant: 全部功能

# ai.usage.filter.allModels
source: All models
ar: جميع النماذج
de: Alle Modelle
es: Todos los modelos
fr: Tous les modèles
id: Semua model
it: Tutti i modelli
ja: すべてのモデル
ko: 모든 모델
nl: Alle modellen
pl: Wszystkie modele
pt_br: Todos os modelos
ru: Все модели
tr: Tüm modeller
uk: Усі моделі
vi: Tất cả mô hình
zh_hans: 全部模型
zh_hant: 全部模型

# ai.usage.filter.allProviders
source: All providers
ar: جميع المزودين
de: Alle Anbieter
es: Todos los proveedores
fr: Tous les fournisseurs
id: Semua penyedia
it: Tutti i provider
ja: すべてのプロバイダ
ko: 모든 제공자
nl: Alle aanbieders
pl: Wszyscy dostawcy
pt_br: Todos os provedores
ru: Все провайдеры
tr: Tüm sağlayıcılar
uk: Усі провайдери
vi: Tất cả nhà cung cấp
zh_hans: 全部服务商
zh_hant: 全部服務商

# ai.usage.filter.feature
source: Feature
ar: الميزة
de: Funktion
es: Función
fr: Fonctionnalité
id: Fitur
it: Funzionalità
ja: 機能
ko: 기능
nl: Functie
pl: Funkcja
pt_br: Recurso
ru: Функция
tr: Özellik
uk: Функція
vi: Tính năng
zh_hans: 功能
zh_hant: 功能

# ai.usage.filter.model
source: Model
ar: النموذج
de: Modell
es: Modelo
fr: Modèle
it: Modello
ja: モデル
ko: 모델
pt_br: Modelo
ru: Модель
uk: Модель
vi: Mô hình
zh_hans: 模型
zh_hant: 模型

# ai.usage.filter.provider
source: Provider
ar: المزود
de: Anbieter
es: Proveedor
fr: Fournisseur
id: Penyedia
ja: プロバイダ
ko: 제공자
nl: Aanbieder
pl: Dostawca
pt_br: Provedor
ru: Провайдер
tr: Sağlayıcı
uk: Провайдер
vi: Nhà cung cấp
zh_hans: 服务商
zh_hant: 服務商

# ai.usage.filter.range
source: Time range
ar: النطاق الزمني
de: Zeitraum
es: Rango de tiempo
fr: Période
id: Rentang waktu
it: Intervallo di tempo
ja: 時間範囲
ko: 시간 범위
nl: Tijdsbereik
pl: Zakres czasu
pt_br: Período
ru: Диапазон времени
tr: Zaman aralığı
uk: Часовий проміжок
vi: Khoảng thời gian
zh_hans: 时间范围
zh_hant: 時間範圍

# ai.usage.filter.unknownProviderFormat
source: Previous provider · %@
ar: المزود السابق · %@
de: Vorheriger Anbieter · %@
es: Proveedor anterior · %@
fr: Fournisseur précédent · %@
id: Penyedia sebelumnya · %@
it: Provider precedente · %@
ja: 以前のプロバイダ · %@
ko: 이전 제공자 · %@
nl: Vorige aanbieder · %@
pl: Poprzedni dostawca · %@
pt_br: Provedor anterior · %@
ru: Предыдущий провайдер · %@
tr: Önceki sağlayıcı · %@
uk: Попередній провайдер · %@
vi: Nhà cung cấp trước · %@
zh_hans: 历史服务商 · %@
zh_hant: 歷史服務商 · %@

# ai.usage.metric.calls
source: API calls
ar: مكالمات API
de: API-Aufrufe
es: Llamadas a la API
fr: Appels API
id: Panggilan API
it: Chiamate API
ja: API呼び出し
ko: API 호출
nl: API-oproepen
pl: Wywołania API
pt_br: Chamadas de API
ru: API-вызовы
tr: API çağrıları
uk: API виклики
vi: Cuộc gọi API
zh_hans: API 调用
zh_hant: API 呼叫

# ai.usage.metric.embeddingHint
source: Items processed in batches
ar: العناصر المعالجة على دفعات
de: Elemente in Batches verarbeitet
es: Elementos procesados en lotes
fr: Éléments traités par lots
id: Item diproses dalam batch
it: Elementi elaborati in batch
ja: バッチで処理されたアイテム
ko: 배치로 처리된 항목
nl: Items verwerkt in batches
pl: Elementy przetwarzane partiami
pt_br: Itens processados em lotes
ru: Элементы обрабатываются пакетами
tr: Toplu işlenen öğeler
uk: Елементи обробляються пакетами
vi: Các mục được xử lý theo lô
zh_hans: 批量请求处理的条目数
zh_hant: 批次請求處理的條目數
